// miniprogram/pages/bind_page/bind_page.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    colleges:[
      "电气工程学院",
      "机械工程学院",
      "理学院",
      "能源与动力工程学院",
      "电子与信息工程学院",
      "法学院",
      "航天航空学院",
      "材料科学与工程学院",
      "软件学院",
      '人居环境与建筑工程学院',
      "生命科学与技术学院",
      "医学部",
      "经济与金融学院",
      "公共政策与管理学院",
      "管理学院",
      "人文社会科学学院",
      "金禾经济研究中心",
      "外国语学院",
      "前沿科学技术研究院",
      "数学与统计学院",
      "化学工程与技术学院",
      "体育中心",
      "马克思主义学院",
      "可持续发展学院",
      "国际教育学院",	
      "继续教育学院",	
      "网络教育学院",
    ],
    collegeIndex:0,
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})